// @flow

export type CitiesDataType = {
  name: string,
  key: number,
  cities: Array<{
    name: string,
    key: number | string
  }>
};

const data: Array<CitiesDataType> = [
  {
    name: "آذربایجان شرقی",
    key: 1,
    cities: [
      { name: "آذرشهر", key: "5" },
      { name: "اسکو", key: "27" },
      { name: "اهر", key: "38" },
      { name: "بستان آباد", key: "57" },
      { name: "بناب", key: "60" },
      { name: "تبریز", key: "87" },
      { name: "جلفا", key: "101" },
      { name: "سراب", key: "172" },
      { name: "شبستر", key: "195" },
      { name: "عجب شیر", key: "213" },
      { name: "کلیبر", key: "245" },
      { name: "مراغه", key: "278" },
      { name: "مرند", key: "279" },
      { name: "ملکان", key: "286" },
      { name: "میانه", key: "294" },
      { name: "هریس", key: "314" },
      { name: "هشترود", key: "315" },
      { name: "ورزقان", key: "319" }
    ]
  },
  {
    name: "آذربایجان غربی",
    key: 2,
    cities: [
      { name: "ارومیه", key: "22" },
      { name: "اشنویه", key: "30" },
      { name: "بوکان", key: "74" },
      { name: "پیرانشهر", key: "84" },
      { name: "تکاب", key: "92" },
      { name: "چالدران", key: "110" },
      { name: "خوی", key: "128" },
      { name: "سردشت", key: "178" },
      { name: "سلماس", key: "182" },
      { name: "شاهین دژ", key: "194" },
      { name: "ماکو", key: "272" },
      { name: "مهاباد", key: "289" },
      { name: "میاندوآب", key: "293" },
      { name: "نقده", key: "302" }
    ]
  },
  {
    name: "اردبیل",
    key: 3,
    cities: [
      { name: "اردبیل", key: "17" },
      { name: "بیله سوار", key: "78" },
      { name: "پارس آباد", key: "79" },
      { name: "خلخال", key: "121" },
      { name: "کوثر", key: "251" },
      { name: "گرمی", key: "258" },
      { name: "مشگین شهر", key: "283" },
      { name: "نمین", key: "303" },
      { name: "نیر", key: "309" }
    ]
  },
  {
    name: "اصفهان",
    key: 4,
    cities: [
      { name: "آران وبیدگل", key: "6" },
      { name: "اردستان", key: "18" },
      { name: "اصفهان", key: "31" },
      { name: "برخوار", key: "360" },
      { name: "بوئین و میاندشت", key: "351" },
      { name: "تیران وکرون", key: "97" },
      { name: "چادگان", key: "108" },
      { name: "خمینی شهر", key: "124" },
      { name: "خوانسار", key: "127" },
      { name: "سمیرم", key: "184" },
      { name: "شاهین شهر و میمه", key: "52" },
      { name: "شهرضا", key: "199" },
      { name: "فریدن", key: "220" },
      { name: "فریدون شهر", key: "221" },
      { name: "فلاورجان", key: "224" },
      { name: "کاشان", key: "238" },
      { name: "گالیکش", key: "355" },
      { name: "گلپایگان", key: "259" },
      { name: "لنجان", key: "269" },
      { name: "مبارکه", key: "275" },
      { name: "نائین", key: "298" },
      { name: "نجف آباد", key: "299" },
      { name: "نطنز", key: "300" }
    ]
  },
  {
    name: "ایلام",
    key: 5,
    cities: [
      { name: "آبدانان", key: "3" },
      { name: "ارکواز ملکشاهی", key: "358" },
      { name: "ایلام", key: "43" },
      { name: "ایوان", key: "44" },
      { name: "دره شهر", key: "132" },
      { name: "دهلران", key: "141" },
      { name: "شیروان وچرداول", key: "206" },
      { name: "مهران", key: "291" }
    ]
  },
  {
    name: "بوشهر",
    key: 6,
    cities: [
      { name: "بوشهر", key: "73" },
      { name: "تنگستان", key: "94" },
      { name: "جم", key: "102" },
      { name: "دشتستان", key: "135" },
      { name: "دشتی", key: "136" },
      { name: "دیر", key: "143" },
      { name: "دیلم", key: "144" },
      { name: "کنگان", key: "247" },
      { name: "گناوه", key: "261" }
    ]
  },
  {
    name: "چهار محال بختیاری",
    key: 9,
    cities: [
      { name: "اردل", key: "20" },
      { name: "بروجن", key: "56" },
      { name: "شهرکرد", key: "200" },
      { name: "فارسان", key: "216" },
      { name: "کوهرنگ", key: "253" },
      { name: "لردگان", key: "268" }
    ]
  },
  {
    name: "تهران",
    key: 8,
    cities: [
      { name: "اسلامشهر", key: "29" },
      { name: "پاکدشت", key: "81" },
      { name: "تهران بزرگ", key: "95" },
      { name: "دماوند", key: "139" },
      { name: "رباط کریم", key: "150" },
      { name: "ری", key: "160" },
      { name: "ساوجبلاغ", key: "168" },
      { name: "شمیرانات", key: "197" },
      { name: "شهریار", key: "201" },
      { name: "فیروزکوه", key: "227" },
      { name: "ورامین", key: "318" }
    ]
  },
  {
    name: "خراسان رضوی",
    key: 10,
    cities: [
      { name: "بجستان", key: "348" },
      { name: "بردسکن", key: "53" },
      { name: "تایباد", key: "86" },
      { name: "تربت جام", key: "88" },
      { name: "تربت حیدریه", key: "89" },
      { name: "چناران", key: "112" },
      { name: "خلیل آباد", key: "122" },
      { name: "خواف", key: "126" },
      { name: "درگز", key: "131" },
      { name: "رشتخوار", key: "153" },
      { name: "سبزوار", key: "170" },
      { name: "سرخس", key: "177" },
      { name: "فردوس", key: "219" },
      { name: "فریمان", key: "222" },
      { name: "قوچان", key: "235" },
      { name: "کاشمر", key: "239" },
      { name: "کلات", key: "322" },
      { name: "گناباد", key: "260" },
      { name: "مشهد", key: "284" },
      { name: "نیشابور", key: "310" }
    ]
  },
  {
    name: "خوزستان",
    key: 11,
    cities: [
      { name: "آبادان", key: "1" },
      { name: "امیدیه", key: "36" },
      { name: "اندیمشک", key: "37" },
      { name: "اهواز", key: "39" },
      { name: "ایذه", key: "41" },
      { name: "باغ ملک", key: "47" },
      { name: "بندرماهشهر", key: "66" },
      { name: "بهبهان", key: "68" },
      { name: "خرمشهر", key: "120" },
      { name: "دزفول", key: "133" },
      { name: "دشت آزادگان", key: "134" },
      { name: "رامهرمز", key: "147" },
      { name: "شادگان", key: "191" },
      { name: "شوش", key: "202" },
      { name: "شوشتر", key: "203" },
      { name: "لالی", key: "265" },
      { name: "مسجدسلیمان", key: "282" },
      { name: "هندیجان", key: "317" }
    ]
  },
  {
    name: "زنجان",
    key: 12,
    cities: [
      { name: "ابهر", key: "14" },
      { name: "ایجرود", key: "40" },
      { name: "خدابنده", key: "116" },
      { name: "خرمدره", key: "119" },
      { name: "زنجان", key: "166" },
      { name: "طارم", key: "210" },
      { name: "ماه نشان", key: "274" }
    ]
  },
  {
    name: "سمنان",
    key: 13,
    cities: [
      { name: "دامغان", key: "130" },
      { name: "سمنان", key: "183" },
      { name: "شاهرود", key: "193" },
      { name: "گرمسار", key: "257" }
    ]
  },
  {
    name: "سیستان و بلوچستان",
    key: 14,
    cities: [
      { name: "ایرانشهر", key: "42" },
      { name: "چابهار", key: "107" },
      { name: "خاش", key: "115" },
      { name: "زابل", key: "161" },
      { name: "زاهدان", key: "162" },
      { name: "زهک", key: "357" },
      { name: "سراوان", key: "173" },
      { name: "سرباز", key: "174" },
      { name: "نیک شهر", key: "311" }
    ]
  },
  {
    name: "فارس",
    key: 15,
    cities: [
      { name: "آباده", key: "2" },
      { name: "ارسنجان", key: "21" },
      { name: "استهبان", key: "24" },
      { name: "اقلید", key: "32" },
      { name: "بوانات", key: "72" },
      { name: "پاسارگاد", key: "80" },
      { name: "جهرم", key: "103" },
      { name: "خرم بید", key: "118" },
      { name: "خنج", key: "125" },
      { name: "داراب", key: "129" },
      { name: "زرین دشت", key: "165" },
      { name: "سپیدان", key: "171" },
      { name: "شیراز", key: "204" },
      { name: "فراشبند", key: "218" },
      { name: "فسا", key: "223" },
      { name: "فیروزآباد", key: "226" },
      { name: "قیر و کارزین", key: "236" },
      { name: "کازرون", key: "237" },
      { name: "گراش", key: "353" },
      { name: "لارستان", key: "264" },
      { name: "لامرد", key: "266" },
      { name: "مرودشت", key: "280" },
      { name: "ممسنی", key: "287" },
      { name: "مهر", key: "290" },
      { name: "نی ریز", key: "308" }
    ]
  },
  {
    name: "قزوین",
    key: 16,
    cities: [
      { name: "آبیک", key: "4" },
      { name: "البرز", key: "33" },
      { name: "بوئین زهرا", key: "71" },
      { name: "تاکستان", key: "85" },
      { name: "قزوین", key: "231" }
    ]
  },
  {
    name: "قم",
    key: 17,
    cities: [{ name: "سلفچگان", key: "349" }, { name: "قم", key: "234" }]
  },
  {
    name: "",
    key: 18,
    cities: [
      { name: "بانه", key: "50" },
      { name: "بیجار", key: "76" },
      { name: "دیواندره", key: "145" },
      { name: "سروآباد", key: "179" },
      { name: "سقز", key: "180" },
      { name: "سنندج", key: "187" },
      { name: "قروه", key: "230" },
      { name: "کامیاران", key: "240" },
      { name: "مریوان", key: "281" }
    ]
  },
  {
    name: "کرمان",
    key: 19,
    cities: [
      { name: "بافت", key: "48" },
      { name: "بردسیر", key: "54" },
      { name: "بم", key: "59" },
      { name: "جیرفت", key: "106" },
      { name: "راور", key: "149" },
      { name: "رفسنجان", key: "155" },
      { name: "زرند", key: "163" },
      { name: "سیرجان", key: "190" },
      { name: "شهربابک", key: "198" },
      { name: "عنبرآباد", key: "215" },
      { name: "کرمان", key: "243" },
      { name: "کهنوج", key: "250" },
      { name: "کوهبنان", key: "324" },
      { name: "منوجان", key: "288" }
    ]
  },
  {
    name: "مرمانشاه",
    key: 20,
    cities: [
      { name: "اسلام آبادغرب", key: "28" },
      { name: "پاوه", key: "82" },
      { name: "ثلاث باباجانی", key: "98" },
      { name: "جوانرود", key: "104" },
      { name: "روانسر", key: "156" },
      { name: "سرپل ذهاب", key: "176" },
      { name: "سنقر", key: "186" },
      { name: "صحنه", key: "207" },
      { name: "قصرشیرین", key: "233" },
      { name: "کرمانشاه", key: "244" },
      { name: "کنگاور", key: "248" },
      { name: "گیلانغرب", key: "263" },
      { name: "هرسین", key: "313" }
    ]
  },
  {
    name: "کهگیلویه و بویر احمد",
    key: 21,
    cities: [
      { name: "بهمئی", key: "70" },
      { name: "بویراحمد", key: "75" },
      { name: "دنا", key: "140" },
      { name: "کهگیلویه", key: "249" },
      { name: "گچساران", key: "255" },
      { name: "یاسوج", key: "325" }
    ]
  },
  {
    name: "گلستان",
    key: 22,
    cities: [
      { name: "آزادشهر", key: "7" },
      { name: "آق قلا", key: "11" },
      { name: "بندرترکمن", key: "62" },
      { name: "بندرگز", key: "64" },
      { name: "رامیان", key: "148" },
      { name: "علی آباد", key: "214" },
      { name: "کردکوی", key: "321" },
      { name: "کلاله", key: "323" },
      { name: "گالیکش", key: "359" },
      { name: "گرگان", key: "256" },
      { name: "گنبدکاووس", key: "262" },
      { name: "مینودشت", key: "297" }
    ]
  },
  {
    name: "گیلان",
    key: 23,
    cities: [
      { name: "آستارا", key: "8" },
      { name: "آستانه اشرفیه", key: "9" },
      { name: "املش", key: "35" },
      { name: "بندرانزلی", key: "61" },
      { name: "تالش", key: "212" },
      { name: "رشت", key: "152" },
      { name: "رضوانشهر", key: "154" },
      { name: "رودبار", key: "158" },
      { name: "رودسر", key: "159" },
      { name: "سیاهکل", key: "189" },
      { name: "شفت", key: "196" },
      { name: "صومعه سرا", key: "209" },
      { name: "فومن", key: "225" },
      { name: "لاهیجان", key: "267" },
      { name: "لنگرود", key: "270" },
      { name: "ماسال", key: "271" }
    ]
  },
  {
    name: "لرستان",
    key: 24,
    cities: [
      { name: "ازنا", key: "23" },
      { name: "الیگودرز", key: "34" },
      { name: "بروجرد", key: "55" },
      { name: "پلدختر", key: "83" },
      { name: "خرم آباد", key: "117" },
      { name: "دلفان", key: "137" },
      { name: "دورود", key: "142" },
      { name: "سلسله", key: "181" },
      { name: "کوهدشت", key: "252" }
    ]
  },
  {
    name: "مازندران",
    key: 25,
    cities: [
      { name: "آمل", key: "12" },
      { name: "بابل", key: "45" },
      { name: "بابلسر", key: "46" },
      { name: "بهشهر", key: "69" },
      { name: "تنکابن", key: "93" },
      { name: "جویبار", key: "105" },
      { name: "چالوس", key: "111" },
      { name: "رامسر", key: "146" },
      { name: "ساری", key: "167" },
      { name: "سوادکوه", key: "188" },
      { name: "قائم شهر", key: "228" },
      { name: "محمودآباد", key: "277" },
      { name: "نکا", key: "312" },
      { name: "نور", key: "306" },
      { name: "نوشهر", key: "307" }
    ]
  },
  {
    name: "مرکزی",
    key: 26,
    cities: [
      { name: "اراک", key: "16" },
      { name: "آشتیان", key: "10" },
      { name: "تفرش", key: "91" },
      { name: "خمین", key: "123" },
      { name: "خنداب", key: "356" },
      { name: "دلیجان", key: "138" },
      { name: "زرندیه", key: "164" },
      { name: "ساوه", key: "169" },
      { name: "شازند", key: "192" },
      { name: "کمیجان", key: "246" },
      { name: "محلات", key: "276" }
    ]
  },
  {
    name: "هرمزگان",
    key: 27,
    cities: [
      { name: "ابوموسی", key: "15" },
      { name: "بستک", key: "58" },
      { name: "بندرعباس", key: "63" },
      { name: "بندرلنگه", key: "65" },
      { name: "جاسک", key: "100" },
      { name: "جزیره کیش", key: "350" },
      { name: "حاجی آباد", key: "113" },
      { name: "رودان", key: "157" },
      { name: "قشم", key: "232" },
      { name: "گاوبندی", key: "254" },
      { name: "میناب", key: "296" }
    ]
  },
  {
    name: "همدان",
    key: 28,
    cities: [
      { name: "اسدآباد", key: "25" },
      { name: "بهار", key: "67" },
      { name: "تویسرکان", key: "96" },
      { name: "رزن", key: "151" },
      { name: "فامنین", key: "354" },
      { name: "کبودرآهنگ", key: "241" },
      { name: "ملایر", key: "285" },
      { name: "نهاوند", key: "304" },
      { name: "همدان", key: "316" }
    ]
  },
  {
    name: "یزد",
    key: 29,
    cities: [
      { name: "ابرکوه", key: "13" },
      { name: "اردکان", key: "19" },
      { name: "اشکذر", key: "208" },
      { name: "بافق", key: "49" },
      { name: "تفت", key: "90" },
      { name: "خاتم", key: "114" },
      { name: "مهریز", key: "292" },
      { name: "میبد", key: "295" },
      { name: "یزد", key: "320" }
    ]
  },
  {
    name: "خراسان جنوبی",
    key: 31,
    cities: [
      { name: "بشرویه", key: "352" },
      { name: "بیرجند", key: "77" },
      { name: "سربیشه", key: "175" },
      { name: "طبس", key: "211" },
      { name: "قائنات", key: "229" },
      { name: "نهبندان", key: "305" }
    ]
  },
  {
    name: "خراسان شمالی",
    key: 32,
    cities: [
      { name: "اسفراین", key: "26" },
      { name: "بجنورد", key: "51" },
      { name: "جاجرم", key: "99" },
      { name: "شیروان", key: "205" },
      { name: "فاروج", key: "217" },
      { name: "مانه و سملقان", key: "273" }
    ]
  },
  {
    name: "البرز",
    key: 33,
    cities: [
      { name: "ساوجبلاغ", key: "326" },
      { name: "طالقان", key: "327" },
      { name: "کرج", key: "242" },
      { name: "نظرآباد", key: "301" }
    ]
  }
];

export default data;
